app/Models/Mlogin.php

SELECT `gr`.`user_id`, `gr`.`user_name`, `gr`.`user_code`, `gr`.`user_password`, `gr`.`user_lastupdated`
FROM `pv_user`, `pv_user` as `gr`
WHERE `gr`.`user_name` = 'Rafli'
---
    public function checking_username($username)
    {
        $query = $this->select('gr.user_id, gr.user_name, gr.user_code, gr.user_password, gr.user_lastupdated')
            ->from($this->table . ' as gr')
            ->where('gr.user_name', $username)
            ->get()
            ->getResultArray();